---
type: ExportLayerInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 19
tags: [revit-api, class]
---

# ExportLayerInfo

`Autodesk.Revit.DB.ExportLayerInfo` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLayerInfo | 2014 | `public ExportLayerInfo ()` |
| Method | AddCutLayerModifier | 2014 | `public void AddCutLayerModifier ( LayerModifier layerModifier )` |
| Method | AddLayerModifier | 2014 | `public void AddLayerModifier ( LayerModifier layerModifier )` |
| Method | ClearCutLayerModifiers | 2014 | `public void ClearCutLayerModifiers ()` |
| Method | ClearLayerModifiers | 2014 | `public void ClearLayerModifiers ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCutLayerModifiers | 2014 | `public IList < LayerModifier > GetCutLayerModifiers ()` |
| Method | GetLayerModifiers | 2014 | `public IList < LayerModifier > GetLayerModifiers ()` |
| Method | RemoveCutLayerModifier | 2014 | `public void RemoveCutLayerModifier ( LayerModifier layerModifier )` |
| Method | RemoveLayerModifier | 2014 | `public void RemoveLayerModifier ( LayerModifier layerModifier )` |
| Method | SetCutLayerModifiers | 2014 | `public void SetCutLayerModifiers ( IList < LayerModifier > cutLayermodifiers )` |
| Method | SetLayerModifiers | 2014 | `public void SetLayerModifiers ( IList < LayerModifier > layermodifiers )` |
| Property | CategoryType | 2014 | `public LayerCategoryType CategoryType { get ; set ; }` |
| Property | ColorName | 2014 | `public string ColorName { get ; set ; }` |
| Property | ColorNumber | 2014 | `public int ColorNumber { get ; set ; }` |
| Property | CutColorNumber | 2014 | `public int CutColorNumber { get ; set ; }` |
| Property | CutLayerName | 2014 | `public string CutLayerName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LayerName | 2014 | `public string LayerName { get ; set ; }` |